In [1]:
import pandas as pd
from pandas import Series, DataFrame
# double importing allows us flexibility in writing code

###  Series Review

### Make a Series from scores_list

In [2]:
scores_list = [54, 22, 19, 73, 80]
scores_series = Series(scores_list)
scores_series

# what name do we use for the  0, 1, 2, ... ??       A:  index
# what name do we use for the  54, 22, 19, .... ??   A:  value

0    54
1    22
2    19
3    73
4    80
dtype: int64

### We can make a series from a dictionary

In [3]:
# imagine we hire students and track their weekly hours
week1 = Series({"Rita":5, "Therese":3, "Janice": 6})
week2 = Series({"Rita":3, "Therese":7, "Janice": 4})
week3 = Series({"Therese":5, "Janice":5, "Rita": 8})   # wrong order!
print(week1)
print(week2)
print(week3)

Rita       5
Therese    3
Janice     6
dtype: int64
Rita       3
Therese    7
Janice     4
dtype: int64
Therese    5
Janice     5
Rita       8
dtype: int64

###  For everyone in Week 1, add 3 to their hours

In [4]:
week1 = week1 + 3
week1

Rita       8
Therese    6
Janice     9
dtype: int64

### Make a dataframe that stores everyone's total hours

In [5]:
total_hours = week1 + week2 + week3
total_hours
# the data in week 3 had its indices in a different order

Janice     18
Rita       19
Therese    18
dtype: int64

### What is week1 / week3 ?

In [6]:
week1 / week3
# notice that we didn't have to worry about the order of indices

Janice     1.8
Rita       1.0
Therese    1.2
dtype: float64

###  What type of values are stored in  week1 > week2?

In [7]:
print(week1)
print(week2)
week1 > week2 # indices are ordered the same

Rita       8
Therese    6
Janice     9
dtype: int64
Rita       3
Therese    7
Janice     4
dtype: int64

Rita        True
Therese    False
Janice      True
dtype: bool

###  What is week1 > week3?

In [8]:
print(week1)
print(week3)
# week1 > week3 # indices not in same order

Rita       8
Therese    6
Janice     9
dtype: int64
Therese    5
Janice     5
Rita       8
dtype: int64


# Lecture 28:  Pandas 2 - DataFrames


Learning Objectives:
- Create a DataFrame from 
 - a dictionary of Series, lists, or dicts
 - a list of Series, lists, dicts
- Select a column, row, cell, or rectangular region of a DataFrame
- Convert CSV files into DataFrames and DataFrames into CSV Files
- Access the head or tail of a DataFrame


### Data Frames store 2-dimensional data in tables

## 1. Create a DataFrame a variety of ways
### from a dictionary of Series

In [9]:
names = Series(["Alice", "Bob", "Cindy", "Dan"])
scores = Series([6, 7, 8, 9])

# to make a dictionary of Series, need to write column names for the keys
DataFrame({
    "Player name": names,
    "Score": scores
})

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Create a DataFrame from dictionary of lists

In [10]:
name_list = ["Alice", "Bob", "Cindy", "Dan"]
score_list = [6, 7, 8, 9]
# this is the same as above, reminding us that Series act like lists
DataFrame({
    "Player name": name_list,
    "Score": score_list
})

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Create a DataFrame from dictionary of dicts
We need to make up keys to match the things in each column

In [11]:
data = {
    "Player name": {0: "Alice", 1: "Bob", 2: "Cindy", 3: "Dan"},
    "Score": {0: 6, 1: 7, 2: 8, 3: 9}
}
DataFrame(data)

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Create a DataFrame from list of lists
We have to add the column names, we do this with `columns = [name1, name2, ....]`

In [12]:
data = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]
data
DataFrame(data, columns = ["Player name", "Score"])

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Create a DataFrame from list of dicts

In [13]:
data = [
    {"Player name": "Alice", "Score": 6},
    {"Player name": "Bob", "Score": 7},
    {"Player name": "Cindy", "Score": 8},
    {"Player name": "Dan", "Score": 9}
]
data
DataFrame(data)

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Same as above, but Name the Rows
We can use `index = [name1, name2, ...]` to rename the index of each row

In [14]:
# 
data = [
    {"Player name": "Alice", "Score": 6},
    {"Player name": "Bob", "Score": 7},
    {"Player name": "Cindy", "Score": 8},
    {"Player name": "Dan", "Score": 9}
]
data
DataFrame(data, index=["A", "B", "C", "D"]) # must have a name for each row

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

### Naming the Columns

In [15]:
data = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]
DataFrame(data, columns=["Player name", "Score"])

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

In [16]:
# You try: 
# Make a DataFrame of 4 people you know with different ages
# Give names to both the columns and rows
ages = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]
ages

[['Alice', 6], ['Bob', 7], ['Cindy', 8], ['Dan', 9]]

In [17]:
# Share how you did with this with your neighbor
# If you both did it the same way, try it a different way

## 2. Select a column, row, cell, or rectangular region of a DataFrame
### Data lookup: Series
- `s.loc[X]`   <- lookup by pandas index
- `s.iloc[X]`  <- lookup by integer position

In [18]:
hours = Series({"Alice":6, "Bob":7, "Cindy":8, "Dan":9})
hours

Alice    6
Bob      7
Cindy    8
Dan      9
dtype: int64

In [19]:
hours.loc["Bob"] #Series index

7

In [20]:
hours.iloc[2] #Series integer position

8

In [21]:
hours["Cindy"] #Series index

8

###  Data lookup: DataFrame


- `d.loc[r]`     lookup ROW by pandas ROW index
- `d.iloc[r]`    lookup ROW by ROW integer position
- `d[c]`         lookup COL by COL index
- `d.loc[r, c]`  lookup by ROW index and COL index
- `d.iloc[r, c]`  lookup by ROW integer position and COL integer position

In [22]:
# we often call the object that we make df
data = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]
df = DataFrame(data, index=["A", "B", "C", "D"], columns = ["Player name", "Score"])
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

### What are 3 different ways of accessing row D?

In [23]:
#df["D"] # Nope!
print(df.loc["D"])
print(df.iloc[3])
print(df.iloc[-1])

Player name    Dan
Score            9
Name: D, dtype: object
Player name    Dan
Score            9
Name: D, dtype: object
Player name    Dan
Score            9
Name: D, dtype: object

In [24]:
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

### What is the only  way to access a column?

In [25]:
#df[0] # Nope!
print(df["Player name"])

A    Alice
B      Bob
C    Cindy
D      Dan
Name: Player name, dtype: object

### What are 3 different ways to access a single cell?

In [26]:
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

In [27]:
# How to access Cindy?
#print(df["C", "Player name"]) # Nope!
print(df.loc["C", "Player name"])
print(df.iloc[2, 0])
print(df.iloc[-2, 0])

Cindy
Cindy
Cindy

## How to set values for a specific entry?

- `d.loc[r, c] = new_val`
- `d.iloc[r, c] = new_val`

In [28]:
#change player D's name
df.loc["D", "Player name"] = "Bianca"
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D      Bianca      9

In [29]:
# then add 3 to that player's score using .loc
df.loc["B","Score"] += 3
df

  Player name  Score
A       Alice      6
B         Bob     10
C       Cindy      8
D      Bianca      9

In [30]:
# add 7 to a different player's score using .iloc
df

  Player name  Score
A       Alice      6
B         Bob     10
C       Cindy      8
D      Bianca      9

### Find the max score and the mean score

In [31]:
# find the max and mean of the "Score" column
print(df["Score"].max(), df["Score"].mean())

10 8.25

##  3.  Slicing a DataFrame

- `df.iloc[ROW_SLICE, COL_SLICE]` <- make a rectangular slice from the DataFrame using integer positions
- `df.loc[ROW_SLICE, COL_SLICE]` <- make a rectangular slice from the DataFrame using index

In [32]:
df.iloc[1:3, 0:2]

  Player name  Score
B         Bob     10
C       Cindy      8

In [33]:
df.loc["B":"C", "Player name":"Score"] # notice that this way is inclusive of endpoints

  Player name  Score
B         Bob     10
C       Cindy      8

## Set values for sliced DataFrame

- `d.loc[ROW_SLICE, COL_SLICE] = new_val` <- set value by ROW INDEX and COL INDEX
- `d.iloc[ROW_SLICE, COL_SLICE] = new_val` <- set value by ROW Integer position and COL Integer position

In [34]:
df

  Player name  Score
A       Alice      6
B         Bob     10
C       Cindy      8
D      Bianca      9

In [35]:

df.loc["B":"C", "Score"] += 5
df

  Player name  Score
A       Alice      6
B         Bob     15
C       Cindy     13
D      Bianca      9

### Pandas allows slicing of non-contiguous columns

In [36]:
# just get Player name for Index B and D
df.loc[["B", "D"],"Player name"]

B       Bob
D    Bianca
Name: Player name, dtype: object

In [37]:
# add 2 to the people in rows B and D
df.loc[["B", "D"],"Score"] += 2

## Boolean indexing on a DataFrame

- `d[BOOL SERIES]`  <- makes a new DF of all rows that lined up were True

In [38]:
df

  Player name  Score
A       Alice      6
B         Bob     17
C       Cindy     13
D      Bianca     11

### make a Series of Booleans based on Score >= 15

In [39]:
b = df["Score"] >= 15
b

A    False
B     True
C    False
D    False
Name: Score, dtype: bool

### use b to slice the DataFrame
if b is true, include this row in the new df

In [40]:
df[b]

  Player name  Score
B         Bob     17

### do the last two things in a single step

In [41]:
df[df["Score"] >= 15]

  Player name  Score
B         Bob     17

## 4. Creating DataFrame from csv

In [42]:
# it's that easy!  
df = pd.read_csv("IMDB-Movie-Data.csv")
df

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
1063,1063,Guardians of the Galaxy Vol. 2,"Action, Adventure, Comedy",James Gunn,"Chris Pratt, Zoe Saldana, Dave Bautista, Vin D...",2017,136,7.6,389.81 M
1064,1064,Baby Driver,"Action, Crime, Drama",Edgar Wright,"Ansel Elgort, Jon Bernthal, Jon Hamm, Eiza Gon...",2017,113,7.6,107.83 M
1065,1065,Only the Brave,"Action, Biography, Drama",Joseph Kosinski,"Josh Brolin, Miles Teller, Jeff Bridges, Jenni...",2017,134,7.6,18.34 M
1066,1066,Incredibles 2,"Animation, Action, Adventure",Brad Bird,"Craig T. Nelson, Holly Hunter, Sarah Vowell, H...",2018,118,7.6,608.58 M
1067,1067,A Star Is Born,"Drama, Music, Romance",Bradley Cooper,"Lady Gaga, Bradley Cooper, Sam Elliott, Greg G...",2018,136,7.6,215.29 M

###   View the first few lines of the DataFrame
- `.head(n)` gets the first n lines, 5 is the default

In [43]:
df.head()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

### get the first 2 rows

In [44]:
df.head(2)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M

###   View the first few lines of the DataFrame
- `.tail(n)` gets the last n lines, 5 is the default

In [45]:
df.tail()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
1063,1063,Guardians of the Galaxy Vol. 2,"Action, Adventure, Comedy",James Gunn,"Chris Pratt, Zoe Saldana, Dave Bautista, Vin D...",2017,136,7.6,389.81 M
1064,1064,Baby Driver,"Action, Crime, Drama",Edgar Wright,"Ansel Elgort, Jon Bernthal, Jon Hamm, Eiza Gon...",2017,113,7.6,107.83 M
1065,1065,Only the Brave,"Action, Biography, Drama",Joseph Kosinski,"Josh Brolin, Miles Teller, Jeff Bridges, Jenni...",2017,134,7.6,18.34 M
1066,1066,Incredibles 2,"Animation, Action, Adventure",Brad Bird,"Craig T. Nelson, Holly Hunter, Sarah Vowell, H...",2018,118,7.6,608.58 M
1067,1067,A Star Is Born,"Drama, Music, Romance",Bradley Cooper,"Lady Gaga, Bradley Cooper, Sam Elliott, Greg G...",2018,136,7.6,215.29 M

In [46]:
df.tail(3)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
1065,1065,Only the Brave,"Action, Biography, Drama",Joseph Kosinski,"Josh Brolin, Miles Teller, Jeff Bridges, Jenni...",2017,134,7.6,18.34 M
1066,1066,Incredibles 2,"Animation, Action, Adventure",Brad Bird,"Craig T. Nelson, Holly Hunter, Sarah Vowell, H...",2018,118,7.6,608.58 M
1067,1067,A Star Is Born,"Drama, Music, Romance",Bradley Cooper,"Lady Gaga, Bradley Cooper, Sam Elliott, Greg G...",2018,136,7.6,215.29 M

### what is the min and max year in our DataFrame?

In [47]:
print(df["Year"].min(), df["Year"].max(), sep="\t")

2006	2020

In [48]:
### what is the rows correspond to movies whose title contains "Harry" ?

In [49]:
df   [   df["Title"].str.contains("Harry") ]

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
114,114,Harry Potter and the Deathly Hallows: Part 2,"Adventure,Drama,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2011,130,8.1,380.96
314,314,Harry Potter and the Order of the Phoenix,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, B...",2007,138,7.5,292
417,417,Harry Potter and the Deathly Hallows: Part 1,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, B...",2010,146,7.7,294.98
472,472,Harry Potter and the Half-Blood Prince,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2009,153,7.5,301.96

### what is the movie at index 6 ?

In [50]:
df.iloc[6]

Index                                                       6
Title                                              La La Land
Genre                                      Comedy,Drama,Music
Director                                      Damien Chazelle
Cast        Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....
Year                                                     2016
Runtime                                                   128
Rating                                                    8.3
Revenue                                               151.06M
Name: 6, dtype: object

In [51]:
df

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
1063,1063,Guardians of the Galaxy Vol. 2,"Action, Adventure, Comedy",James Gunn,"Chris Pratt, Zoe Saldana, Dave Bautista, Vin D...",2017,136,7.6,389.81 M
1064,1064,Baby Driver,"Action, Crime, Drama",Edgar Wright,"Ansel Elgort, Jon Bernthal, Jon Hamm, Eiza Gon...",2017,113,7.6,107.83 M
1065,1065,Only the Brave,"Action, Biography, Drama",Joseph Kosinski,"Josh Brolin, Miles Teller, Jeff Bridges, Jenni...",2017,134,7.6,18.34 M
1066,1066,Incredibles 2,"Animation, Action, Adventure",Brad Bird,"Craig T. Nelson, Holly Hunter, Sarah Vowell, H...",2018,118,7.6,608.58 M
1067,1067,A Star Is Born,"Drama, Music, Romance",Bradley Cooper,"Lady Gaga, Bradley Cooper, Sam Elliott, Greg G...",2018,136,7.6,215.29 M

## Notice that there are two index columns
- That happened because when you write a csv from pandas to a file, it writes a new index column
- So if the dataFrame already contains an index, you are going to get two index columns
- Let's fix that problem

### How can you use slicing to get just columns with Title and Year?

In [52]:
df3 = df[["Title", "Year"]]
df3
# notice that this does not have the 'index' column

                               Title  Year
0            Guardians of the Galaxy  2014
1                         Prometheus  2012
2                              Split  2016
3                               Sing  2016
4                      Suicide Squad  2016
...                              ...   ...
1063  Guardians of the Galaxy Vol. 2  2017
1064                     Baby Driver  2017
1065                  Only the Brave  2017
1066                   Incredibles 2  2018
1067                  A Star Is Born  2018

[1068 rows x 2 columns]

### How can you use slicing to get rid of the first column?

In [53]:
df2 =  df.iloc[:, 1:] #all the rows, not column 0
df2

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...
1063,Guardians of the Galaxy Vol. 2,"Action, Adventure, Comedy",James Gunn,"Chris Pratt, Zoe Saldana, Dave Bautista, Vin D...",2017,136,7.6,389.81 M
1064,Baby Driver,"Action, Crime, Drama",Edgar Wright,"Ansel Elgort, Jon Bernthal, Jon Hamm, Eiza Gon...",2017,113,7.6,107.83 M
1065,Only the Brave,"Action, Biography, Drama",Joseph Kosinski,"Josh Brolin, Miles Teller, Jeff Bridges, Jenni...",2017,134,7.6,18.34 M
1066,Incredibles 2,"Animation, Action, Adventure",Brad Bird,"Craig T. Nelson, Holly Hunter, Sarah Vowell, H...",2018,118,7.6,608.58 M
1067,A Star Is Born,"Drama, Music, Romance",Bradley Cooper,"Lady Gaga, Bradley Cooper, Sam Elliott, Greg G...",2018,136,7.6,215.29 M

### Wrong way to write a df to a csv file

In [54]:
df2.to_csv("wrong_movies.csv")

### Correct way to write a df to a csv file

In [55]:
df2.to_csv("better_movies.csv", index = False)

## 5. Practice on your own.....Data Analysis with Data Frames

In [56]:
# What are all the movies that have a runtime greater than the mean? 
long_movies = df [df["Runtime"] > df["Runtime"].mean() ]
long_movies.head()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
6,6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M

In [57]:
# of these movies, what was the min rating? 
min_rating = long_movies["Rating"].min()
min_rating

3.2

In [58]:
# which movies had this min rating?
long_movies[long_movies["Rating"] == min_rating]

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
646,646,Tall Men,"Fantasy,Horror,Thriller",Jonathan Holbrook,"Dan Crisafulli, Kay Whitney, Richard Garcia, P...",2016,133,3.2,0

### what are all long_movies with someone in the cast named "Emma" ?

In [59]:
long_movies[long_movies["Cast"].str.contains("Emma")]

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
6,6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M
92,92,The Help,Drama,Tate Taylor,"Emma Stone, Viola Davis, Octavia Spencer, Bryc...",2011,146,8.1,169.71M
114,114,Harry Potter and the Deathly Hallows: Part 2,"Adventure,Drama,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2011,130,8.1,380.96
157,157,"Crazy, Stupid, Love.","Comedy,Drama,Romance",Glenn Ficarra,"Steve Carell, Ryan Gosling, Julianne Moore, Em...",2011,118,7.4,84.24
253,253,The Amazing Spider-Man 2,"Action,Adventure,Sci-Fi",Marc Webb,"Andrew Garfield, Emma Stone, Jamie Foxx, Paul ...",2014,142,6.7,202.85
314,314,Harry Potter and the Order of the Phoenix,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, B...",2007,138,7.5,292
367,367,The Amazing Spider-Man,"Action,Adventure",Marc Webb,"Andrew Garfield, Emma Stone, Rhys Ifans, Irrfa...",2012,136,7.0,262.03
417,417,Harry Potter and the Deathly Hallows: Part 1,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, B...",2010,146,7.7,294.98
472,472,Harry Potter and the Half-Blood Prince,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2009,153,7.5,301.96
609,609,Beautiful Creatures,"Drama,Fantasy,Romance",Richard LaGravenese,"Alice Englert, Viola Davis, Emma Thompson,Alde...",2013,124,6.2,19.45
717,717,Noah,"Action,Adventure,Drama",Darren Aronofsky,"Russell Crowe, Jennifer Connelly, Anthony Hopk...",2014,138,5.8,101.16M
879,879,Saving Mr. Banks,"Biography,Comedy,Drama",John Lee Hancock,"Emma Thompson, Tom Hanks, Annie Rose Buckley, ...",2013,125,7.5,83.3
1044,1044,Little Women,"Drama, Romance",Greta Gerwig,"Saoirse Ronan, Emma Watson, Florence Pugh, Eli...",2019,135,7.8,108.1 M

In [60]:
# What is the title of the shortest movie?
df[df["Runtime"] == df["Runtime"].min()]  ["Title"]

792    Ma vie de Courgette
Name: Title, dtype: object

In [61]:

# What movie had the highest revenue?
# df["Revnue"].max() did not work
# we need to clean our data

def format_revenue(revenue):
    #TODO: Check the last character of the string
    if type(revenue) == float: # need this in here if we run code multiple times
        return revenue
    if revenue[-1] == 'M':
        return float(revenue[:-1]) * 1e6
    elif revenue[-1] == 'K':
        return float(revenue[:-1]) * 1e3
    else:
        return float(revenue)

In [62]:
# What movie had the highest revenue?
revenue = df["Revenue"].apply(format_revenue) # apply a function to a column
print(revenue.head())
max_revenue = revenue.max()

# make a copy of our df
rev_df = df.copy()
rev_df["Rev as fl"] = revenue
rev_df[rev_df["Rev as fl"] == max_revenue]

0    3.331300e+02
1    1.264600e+08
2    1.381200e+08
3    2.703200e+02
4    3.250200e+02
Name: Revenue, dtype: float64

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue,Rev as fl
1006,1006,Avengers: Endgame,"Action, Adventure, Drama",Anthony Russo,"Joe Russo, Robert Downey Jr., Chris Evans, Mar...",2019,181,8.4,858.37 M,858370000.0

In [63]:
# For a certain director, what is the average runtime? 
fl_movies = df [df["Director"] == "Francis Lawrence"]
fl_movies["Runtime"].mean()

126.75

In [64]:
df

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
1063,1063,Guardians of the Galaxy Vol. 2,"Action, Adventure, Comedy",James Gunn,"Chris Pratt, Zoe Saldana, Dave Bautista, Vin D...",2017,136,7.6,389.81 M
1064,1064,Baby Driver,"Action, Crime, Drama",Edgar Wright,"Ansel Elgort, Jon Bernthal, Jon Hamm, Eiza Gon...",2017,113,7.6,107.83 M
1065,1065,Only the Brave,"Action, Biography, Drama",Joseph Kosinski,"Josh Brolin, Miles Teller, Jeff Bridges, Jenni...",2017,134,7.6,18.34 M
1066,1066,Incredibles 2,"Animation, Action, Adventure",Brad Bird,"Craig T. Nelson, Holly Hunter, Sarah Vowell, H...",2018,118,7.6,608.58 M
1067,1067,A Star Is Born,"Drama, Music, Romance",Bradley Cooper,"Lady Gaga, Bradley Cooper, Sam Elliott, Greg G...",2018,136,7.6,215.29 M

In [65]:
# which director had the highest average rating? 

# one way is to make a python dict of director, list of ratings
director_dict = dict()

# make the dictionary: key is director, value is list of ratings
for i in range(len(df)):
    director = df.loc[i, "Director"]
    rating = df.loc[i, "Rating"]
    #print(i, director, rating)
    if director not in director_dict:
        director_dict[director] = []
    director_dict[director].append(rating)

# make a ratings dict key is directory, value is average
# only include directors with > 4 movies
ratings_dict = {k:sum(v)/len(v) for (k,v) in director_dict.items() if len(v) > 4}

#sort a dict by values
dict(sorted(ratings_dict.items(), key=lambda t:t[-1], reverse=True))

{'Christopher Nolan': 8.533333333333333,
 'Martin Scorsese': 7.916666666666667,
 'Quentin Tarantino': 7.840000000000001,
 'David Fincher': 7.8199999999999985,
 'Denis Villeneuve': 7.8,
 'J.J. Abrams': 7.58,
 'Guy Ritchie': 7.5,
 'David Yates': 7.433333333333334,
 'Danny Boyle': 7.42,
 'Antoine Fuqua': 7.040000000000001,
 'Zack Snyder': 7.040000000000001,
 'Woody Allen': 7.019999999999999,
 'Peter Berg': 6.860000000000001,
 'Ridley Scott': 6.85,
 'Justin Lin': 6.82,
 'Michael Bay': 6.483333333333334,
 'Paul W.S. Anderson': 5.766666666666666,
 'M. Night Shyamalan': 5.533333333333332}

In [66]:
# Extra Practice: Make up some of your own questions about the movies